# Ваше завдання — написати програму, яка перемножує всі цифри, введені користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
#
# Користувач вводить число з клавіатури.
#
# Приклади:
#
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
#
# 1000 -> 0
#
# 423 -> 8
#
# 33 -> 9
#
# 25 -> 0
#
# 1 -> 1

my_num = int(input('введите число:'))
result = my_num
while result > 9:
    n1 = 0
    for el in str(result):
        digit = int(el)
        if n1 == 0:
            n1 = digit
        else:
            n1 *= digit

    result = n1

print(result)